### Exercício 03 
 Manipulando dados com Pandas

## a) Crie um programa em pandas para ler o arquivo em Excel vendas.xlsx e

b) coloque em um dataframe.

In [3]:
import pandas as pd

caminho = ('C:\\Users\\FIC\\Documents\\EdilsonCarl80\\arquivo\\')
arquivo = ('Vendas.xlsx')
#print(caminho + arquivo) 

df =  pd.read_excel(caminho + arquivo, sheet_name= 'Planilha1')

c) Visualize o cabeçalho dos dados;

In [4]:
df.head()

,Coluna 1,Coluna 2,Coluna 3,Coluna 4,Coluna 5,Coluna 6
0,2014-01-01,Bernardo de Sousa,Supervisor de Vendas Pl,ACME,AL,3276.20
1,2014-01-01,Bernardo de Sousa,Supervisor de Vendas Pl,ACME,AP,3005.86
2,2014-01-01,Bernardo de Sousa,Supervisor de Vendas Pl,ACME,MA,8568.54
3,2014-01-01,Bernardo de Sousa,Supervisor de Vendas Pl,ACME,MG,1344.27
4,2014-01-01,Bernardo de Sousa,Supervisor de Vendas Pl,ACME,MS,7585.04

d) Visualize as últimas linhas;

In [5]:
df.tail()

,Coluna 1,Coluna 2,Coluna 3,Coluna 4,Coluna 5,Coluna 6
130461,2016-12-31,Liz Azevedo Santos,Vendedor Pl.,Planet Express,PI,1829.39
130462,2016-12-31,Liz Azevedo Santos,Vendedor Pl.,Planet Express,PR,2378.48
130463,2016-12-31,Liz Azevedo Santos,Vendedor Pl.,Planet Express,RO,4488.47
130464,2016-12-31,Liz Azevedo Santos,Vendedor Pl.,Planet Express,RR,1543.66
130465,2016-12-31,Liz Azevedo Santos,Vendedor Pl.,Planet Express,SC,9820.71

e) Escreva um programa para renomear o cabeçalho da tabela com os

In [15]:
df.columns = ['Data','Vendedor','Cargo','Cliente','UF','Vendas']
#df.rename(columns = {'coluna','data','coluna2':'Vendedor})
#escolher uma coluna especifica

f) seguintes nomes:
Data,Vendedor,Cargo,Cliente,UF,Vendas

In [7]:
df.head()

        Data           Vendedor                    Cargo Cliente  UF   Vendas
0 2014-01-01  Bernardo de Sousa  Supervisor de Vendas Pl    ACME  AL  3276.20
1 2014-01-01  Bernardo de Sousa  Supervisor de Vendas Pl    ACME  AP  3005.86
2 2014-01-01  Bernardo de Sousa  Supervisor de Vendas Pl    ACME  MA  8568.54
3 2014-01-01  Bernardo de Sousa  Supervisor de Vendas Pl    ACME  MG  1344.27
4 2014-01-01  Bernardo de Sousa  Supervisor de Vendas Pl    ACME  MS  7585.04

g) Quais são os tipos de dados que temos no dataframe?

h) Há valores faltantes ou nulos?

Verificar se informções nulas
df['coluna'],isnull
Quantidade
df['isnull.sum]

In [17]:
#indetificar quais registro são nulos
df['Vendas'].isnull()

df['Vendas'].isnull().sum()
#quantificar os elemntos nulos 
#df['Vendas'].isnull().sum()

0

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 130466 entries, 0 to 130465
Data columns (total 6 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   Data      130466 non-null  datetime64[ns]
 1   Vendedor  130466 non-null  object
 2   Cargo     130466 non-null  object
 3   Cliente   130466 non-null  object
 4   UF        130466 non-null  object
 5   Vendas    130466 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 6.0+ MB

i) Calcule a soma, média, máximo, mínimo e contagem da coluna Preço.

In [19]:
print('O total da coluna Vendas é: ', df['Vendas'].sum())
print('a media da coluna Vendas é: ', df['Vendas'].mean())
print('O maior valor da coluna Vendas é: ', df['Vendas'].max())
print('O menor valor da coluna Vendas é: ', df['Vendas'].min())
print('O valor total é: ', df['Vendas'].count())

O total da coluna Vendas é:  718501609.25
a media da coluna Vendas é:  5507.194282418408
O maior valor da coluna Vendas é:  10000.0
O menor valor da coluna Vendas é:  1000.01
O valor total é:  130466

j) Crie um programa para criar um dataframe para mostrar as vendas por cargo, e
salvar um arquivo em csv para com o nome de cada cargo:
▪ Supervisor de Vendas Pl
▪ Gerente Regional Jr.
▪ Supervisor de Vendas Sr
▪ Coordenador de Vendas Pl.
▪ Vendedor Jr.
▪ Vendedor Sr.
▪ Vendedor Pl.
▪ Gerente Regional Pl.
▪ Coordenador de Vendas Sr.
▪ Coordenador de Vendas Jr.
▪ Supervisor de Vendas Jr.

In [16]:
df.describe()

                                Data         Vendas
count                         130466  130466.000000
mean   2015-06-28 17:54:39.143991552    5507.194282
min              2014-01-01 00:00:00    1000.010000
25%              2014-10-06 00:00:00    3258.312500
50%              2015-06-22 00:00:00    5509.190000
75%              2016-03-30 00:00:00    7759.095000
max              2016-12-31 00:00:00   10000.000000
std                              NaN    2598.113042

In [26]:
dados = df[df['Cargo'] == 'Supervisor de Vendas Pl']

pasta_destino = 'C:\\Users\\FIC\\Documents\\EdilsonCarl80\\arquivo\\Arquivos de Vendas\\'

Nome_arquivo = 'Supervisor de Vendas pl.csv'

dados.to_csv(pasta_destino + Nome_arquivo, encoding='ANSI')

In [29]:
dados = df[df['Cargo'] == 'Gerente Regional Jr.']

pasta_destino = 'C:\\Users\\FIC\\Documents\\EdilsonCarl80\\arquivo\\Arquivos de Vendas\\'

Nome_arquivo = 'Gerente Regional Jr.csv'

dados.to_csv(pasta_destino + Nome_arquivo, encoding='ANSI')

In [28]:
dados = df[df['Cargo'] == 'Supervisor de Vendas Sr']

pasta_destino = 'C:\\Users\\FIC\\Documents\\EdilsonCarl80\\arquivo\\Arquivos de Vendas\\'

Nome_arquivo = 'Supervisor de Vendas Sr.csv'

dados.to_csv(pasta_destino + Nome_arquivo, encoding='ANSI')

In [30]:
dados = df[df['Cargo'] == 'Coordenador de Vendas Pl.']

pasta_destino = 'C:\\Users\\FIC\\Documents\\EdilsonCarl80\\arquivo\\Arquivos de Vendas\\'

Nome_arquivo = 'Coordenador de Vendas Pl.csv'

dados.to_csv(pasta_destino + Nome_arquivo, encoding='ANSI')

In [31]:
dados = df[df['Cargo'] == 'Vendedor Jr.']
pasta_destino = 'C:\\Users\\FIC\\Documents\\EdilsonCarl80\\arquivo\\Arquivos de Vendas\\'

Nome_arquivo = 'Vendedor Jr.csv'
dados.to_csv(pasta_destino + Nome_arquivo, encoding='ANSI')

9. Crie um dataframe para cada coluna, contendo dados únicos.

In [33]:
#Criar um dataframe apenas a coluna Cargo
dados_cargos = df['Cargo']
#Contar qauntos elementos antes de remover  as duplicadas
dados_cargos.count()
#Criar um novo dataframe sem duplicadas
dados_cargos = dados_cargos.drop_duplicates()

#contar quantos elementos ficaram apos a remoção das dulplicads 
dados_cargos.count()
dados_cargos

0        Supervisor de Vendas Pl
11          Gerente Regional Jr.
37       Supervisor de Vendas Sr
48     Coordenador de Vendas Pl.
98                  Vendedor Jr.
162                 Vendedor Sr.
174                 Vendedor Pl.
186         Gerente Regional Pl.
276    Coordenador de Vendas Sr.
285    Coordenador de Vendas Jr.
436     Supervisor de Vendas Jr.
Name: Cargo, dtype: object